Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["go-libipfs-rapide:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.this["go-libipfs-rapide"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = "main"
      + delete_branch_on_merge = false
      + description            = "A fork of go-libipfs with experimental RAPIDE client."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "go-libipfs-rapide"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository_collaborator.this["go-libipfs-rapide:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "go-libipfs-rapide"
      + username                    = "web3-bot"
    }

  # github_repository_file.this["go-libipfs-rapide/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
              - cron: '0 0 * * *'
            
            jobs:
              stale:
            
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
            
                steps:
                - uses: actions/stale@v3
                  with:
                    repo-token: ${{ secrets.GITHUB_TOKEN }}
                    stale-issue-message: 'Oops, seems like we needed more information for this issue, please comment with more details or this issue will be closed in 7 days.'
                    close-issue-message: 'This issue was closed because it is missing author input.'
                    stale-issue-label: 'kind/stale'
                    any-of-labels: 'need/author-input'
                    exempt-issue-labels: 'need/triage,need/community-input,need/maintainer-input,need/maintainers-input,need/analysis,status/blocked,status/in-progress,status/ready,status/deferred,status/inactive'
                    days-before-issue-stale: 6
                    days-before-issue-close: 7
                    enable-statistics: true
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "go-libipfs-rapide"
      + sha                 = (known after apply)
    }

  # github_team_repository.this["admin:go-libipfs-rapide"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-libipfs-rapide"
      + team_id    = "1516991"
    }

  # github_team_repository.this["ipdx:go-libipfs-rapide"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-libipfs-rapide"
      + team_id    = "6349983"
    }

  # github_team_repository.this["merge - go:go-libipfs-rapide"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "go-libipfs-rapide"
      + team_id    = "3364102"
    }

  # github_team_repository.this["repos - go:go-libipfs-rapide"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "go-libipfs-rapide"
      + team_id    = "3232508"
    }

  # github_team_repository.this["w3dt-stewards:go-libipfs-rapide"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-libipfs-rapide"
      + team_id    = "4656983"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->